# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [7]:
data1 = pd.Series(np.random.randint(1,5,100,dtype='int'))
data2 = pd.Series(np.random.randint(1,4,100,dtype='int'))
data3 = pd.Series(np.random.randint(10000,30001,100,dtype='l'))
data3

0     22698
1     17546
2     17234
3     22410
4     12845
      ...
95    18797
96    24252
97    29785
98    12435
99    22619
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [10]:
df = pd.DataFrame(pd.concat([data1,data2,data3], axis=1))
df

    0  1      2
0   2  1  22698
1   2  3  17546
2   3  1  17234
3   1  1  22410
4   4  2  12845
.. .. ..    ...
95  3  3  18797
96  4  3  24252
97  1  1  29785
98  1  2  12435
99  4  3  22619

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [13]:
df.columns = ['bedrs','bathrs','price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       2       1            22698
1       2       3            17546
2       3       1            17234
3       1       1            22410
4       4       2            12845
..    ...     ...              ...
95      3       3            18797
96      4       3            24252
97      1       1            29785
98      1       2            12435
99      4       3            22619

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [20]:
bigcolumn = pd.DataFrame(pd.concat([data1,data2,data3], axis=0))
bigcolumn

        0
0       2
1       2
2       3
3       1
4       4
..    ...
95  18797
96  24252
97  29785
98  12435
99  22619

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [23]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [25]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        2
1        2
2        3
3        1
4        4
..     ...
295  18797
296  24252
297  29785
298  12435
299  22619

[300 rows x 1 columns]